---
type: PrimarySizeCriterion
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# PrimarySizeCriterion

`Autodesk.Revit.DB.PrimarySizeCriterion` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PrimarySizeCriterion | 2013 | `public PrimarySizeCriterion ( double minimumSize , double maximumSize )` |
| Method | All | 2013 | `public static PrimarySizeCriterion All ()` |
| Method | None | 2013 | `public static PrimarySizeCriterion None ()` |
| Property | MaximumSize | 2013 | `public double MaximumSize { get ; set ; }` |
| Property | MinimumSize | 2013 | `public double MinimumSize { get ; set ; }` |